In [1]:
%reload_ext sql

In [2]:
%%sql
sqlite:///CourseData2.db

'Connected: @CourseData2.db'

Create CourseNum Table

In [84]:
%%sql
CREATE TABLE CourseNum(
    term TEXT NOT NULL,
    crn INTEGER SURROGATE KEY,
    catalog_id TEXT NOT NULL
    );

 * sqlite:///CourseData2.db
Done.

[]

Insert into the CourseNum Table

In [85]:
%%sql
INSERT INTO CourseNum (term,crn,catalog_id)
SELECT DISTINCT term,crn,catalog_id
FROM courses;

 * sqlite:///CourseData2.db
15937 rows affected.

[]

In [86]:
%%sql
SELECT *
FROM CourseNum
LIMIT 10;

 * sqlite:///CourseData2.db
Done.

[('Fall2014', 70384, 'AC 0011'),
 ('Fall2014', 70385, 'AC 0011'),
 ('Fall2014', 70382, 'AC 0011'),
 ('Fall2014', 70291, 'AC 0011'),
 ('Fall2014', 70350, 'AC 0011'),
 ('Fall2014', 70381, 'AC 0011'),
 ('Fall2014', 70383, 'AC 0011'),
 ('Fall2014', 70391, 'AC 0011'),
 ('Fall2014', 71105, 'AC 0011'),
 ('Fall2014', 71123, 'AC 0011')]

Create CourseTitle Table

In [88]:
%%sql
CREATE TABLE CourseTitle(
    catalog_id TEXT SURROGATE KEY,
    credits INTEGER NOT NULL,
    course_title TEXT NOT NULL,
    description TEXT NOT NULL);

 * sqlite:///CourseData2.db
Done.

[]

Insert into the CourseTitle Table

In [89]:
%%sql
INSERT INTO CourseTitle (catalog_id, credits, course_title, description)
SELECT CC.catalog_id AS Catalog_ID, CC.credits AS Credits, CC.course_title AS Title,
CC.description AS Description
FROM coursecatalog CC 
    JOIN (SELECT description FROM coursecatalog 
          GROUP BY description) on CC.description = CC.description;

 * sqlite:///CourseData2.db
0 rows affected.

[]

Create CourseDay Table

In [91]:
%%sql
CREATE TABLE CourseDay(
    crn INTEGER SURROGATE KEY,
    day TEXT NOT NULL,
    start TEXT NOT NULL,
    end TEXT NOT NULL);

 * sqlite:///CourseData2.db
Done.

[]

Insert into CourseDat Table

In [92]:
%%sql
INSERT INTO CourseDay (crn,day,start,end)
SELECT crn,day,start,end
FROM coursemeetings;

 * sqlite:///CourseData2.db
317321 rows affected.

[]

In [93]:
%%sql
SELECT *
FROM CourseDay
LIMIT 10;

 * sqlite:///CourseData2.db
Done.

[(70384, 'T', '2014-09-02T08:00:00', '2014-09-02T09:15:00'),
 (70384, 'F', '2014-09-05T08:00:00', '2014-09-05T09:15:00'),
 (70384, 'T', '2014-09-09T08:00:00', '2014-09-09T09:15:00'),
 (70384, 'F', '2014-09-12T08:00:00', '2014-09-12T09:15:00'),
 (70384, 'T', '2014-09-16T08:00:00', '2014-09-16T09:15:00'),
 (70384, 'F', '2014-09-19T08:00:00', '2014-09-19T09:15:00'),
 (70384, 'T', '2014-09-23T08:00:00', '2014-09-23T09:15:00'),
 (70384, 'F', '2014-09-26T08:00:00', '2014-09-26T09:15:00'),
 (70384, 'T', '2014-09-30T08:00:00', '2014-09-30T09:15:00'),
 (70384, 'F', '2014-10-03T08:00:00', '2014-10-03T09:15:00')]

Create CatalogCourse Table

In [95]:
%%sql
CREATE TABLE CatalogCourse(
    catalog_id TEXT SURROGATE KEY,
    program_code TEXT NOT NULL,
    program_name TEXT NOT NULL,
    prereqs TEXT NOT NULL,
    coreqs TEXT NOT NULL,
    fees TEXT NOT NULL
    );

 * sqlite:///CourseData2.db
Done.

[]

Insert into CatalogCourse Table

In [96]:
%%sql
INSERT INTO CatalogCourse (catalog_id, program_code, program_name, prereqs, coreqs, fees)
SELECT catalog_id, program_code, program_name, prereqs, coreqs, fees
FROM coursecatalog;

 * sqlite:///CourseData2.db
0 rows affected.

[]

In [97]:
%%sql
SELECT *
FROM CatalogCourse
LIMIT 10;

 * sqlite:///CourseData2.db
Done.

[]

Create the CourseInfo Table

In [99]:
%%sql
CREATE TABLE CourseInfo(
    crn INTEGER SURROGATE, 
    section TEXT NOT NULL,
    primary_instructor TEXT NOT NULL,
    location TEXT NOT NULL,
    cap INTEGER NOT NULL,
    act INTEGER NOT NULL,
    rem INTEGER NOT NULL);

 * sqlite:///CourseData2.db
Done.

[]

Insert into CourseInfo Table

In [100]:
%%sql
INSERT INTO CourseInfo (crn,section, primary_instructor, location, cap, act, rem)
SELECT C.crn AS CourseNumber, C.section AS Section, C.primary_instructor AS Teacher,
M.location AS Room, C.cap AS Capacity, C.act AS NumberOfStudents, C.rem AS SeatsOpen
FROM courses C 
    JOIN (SELECT crn,location FROM coursemeetings 
          GROUP BY crn,location) M on C.crn = M.crn;

 * sqlite:///CourseData2.db
18795 rows affected.

[]

In [101]:
%%sql
SELECT *
FROM CourseInfo
LIMIT 10;

 * sqlite:///CourseData2.db
Done.

[(70384, 'C01', 'Michael P.  Coyne', 'DSB 105', 0, 31, -31),
 (70385, 'C02', 'Michael P.  Coyne', 'DSB 105', 0, 31, -31),
 (70382, 'C03', 'Michael P.  Coyne', 'DSB 105', 0, 31, -31),
 (70291, 'C04', 'Rebecca I.  Bloch', 'DSB 111', 0, 29, -29),
 (70350, 'C05', 'Rebecca I.  Bloch', 'DSB 111', 0, 30, -30),
 (70381, 'C06', 'Rebecca I.  Bloch', 'DSB 110A', 0, 31, -31),
 (70383, 'G', 'Paul   Caster', 'DSB 111', 30, 31, -1),
 (70391, 'H', 'Jo Ann   Drusbosky', 'DSB 110A', 30, 32, -2),
 (71105, 'I', 'Jo Ann   Drusbosky', 'DSB 110A', 30, 33, -3),
 (71123, 'J', 'Jo Ann   Drusbosky', 'DMH 149', 30, 32, -2)]

Creating large tables for Courses, CourseMeetings, and CourseCatalog

In [102]:
%%sql
SELECT *
FROM import_coursemeetingsF14
LIMIT 10

 * sqlite:///CourseData2.db
Done.

[('Fall2014', '70384', 'DSB 105', 'T', '2014-09-02T08:00:00', '2014-09-02T09:15:00'),
 ('Fall2014', '70384', 'DSB 105', 'F', '2014-09-05T08:00:00', '2014-09-05T09:15:00'),
 ('Fall2014', '70384', 'DSB 105', 'T', '2014-09-09T08:00:00', '2014-09-09T09:15:00'),
 ('Fall2014', '70384', 'DSB 105', 'F', '2014-09-12T08:00:00', '2014-09-12T09:15:00'),
 ('Fall2014', '70384', 'DSB 105', 'T', '2014-09-16T08:00:00', '2014-09-16T09:15:00'),
 ('Fall2014', '70384', 'DSB 105', 'F', '2014-09-19T08:00:00', '2014-09-19T09:15:00'),
 ('Fall2014', '70384', 'DSB 105', 'T', '2014-09-23T08:00:00', '2014-09-23T09:15:00'),
 ('Fall2014', '70384', 'DSB 105', 'F', '2014-09-26T08:00:00', '2014-09-26T09:15:00'),
 ('Fall2014', '70384', 'DSB 105', 'T', '2014-09-30T08:00:00', '2014-09-30T09:15:00'),
 ('Fall2014', '70384', 'DSB 105', 'F', '2014-10-03T08:00:00', '2014-10-03T09:15:00')]

In [103]:
%%sql
DROP TABLE IF EXISTS coursemeetings;
CREATE TABLE coursemeetings (
    term TEXT NOT NULL,
    crn INTEGER SURROGATE KEY,
    location TEXT NOT NULL,
    day TEXT SURROGATE KEY,
    start TEXT NOT NULL,
    end TEXT NOT NULL);

 * sqlite:///CourseData2.db
Done.
Done.

[]

In [104]:
%%sql
select * from coursemeetings
limit 10;

 * sqlite:///CourseData2.db
Done.

[]

In [105]:
%%sql
INSERT INTO coursemeetings (term,crn,location,day,start,end)
SELECT term,crn,location,day,start,end
FROM import_coursemeetingsF14

 * sqlite:///CourseData2.db
31505 rows affected.

[]

In [106]:
%%sql
INSERT INTO coursemeetings (term,crn,location,day,start,end)
SELECT term,crn,location,day,start,end
FROM import_coursemeetingsF15

 * sqlite:///CourseData2.db
31456 rows affected.

[]

In [107]:
%%sql
SELECT COUNT (*)
FROM coursemeetings

 * sqlite:///CourseData2.db
Done.

[(62961,)]

In [108]:
%%sql
INSERT INTO coursemeetings (term,crn,location,day,start,end)
SELECT term,crn,location,day,start,end
FROM import_coursemeetingsF16

 * sqlite:///CourseData2.db
31474 rows affected.

[]

In [109]:
%%sql
SELECT COUNT (*)
FROM coursemeetings

 * sqlite:///CourseData2.db
Done.

[(94435,)]

In [110]:
%%sql
INSERT INTO coursemeetings (term,crn,location,day,start,end)
SELECT term,crn,location,day,start,end
FROM import_coursemeetingsF17

 * sqlite:///CourseData2.db
31400 rows affected.

[]

In [111]:
%%sql
SELECT COUNT (*)
FROM coursemeetings

 * sqlite:///CourseData2.db
Done.

[(125835,)]

In [112]:
%%sql
INSERT INTO coursemeetings (term,crn,location,day,start,end)
SELECT term,crn,location,day,start,end
FROM import_coursemeetingsF18

 * sqlite:///CourseData2.db
33440 rows affected.

[]

In [113]:
%%sql
SELECT COUNT (*)
FROM coursemeetings

 * sqlite:///CourseData2.db
Done.

[(159275,)]

In [114]:
%%sql
INSERT INTO coursemeetings (term,crn,location,day,start,end)
SELECT term,crn,location,day,start,end
FROM import_coursemeetingsS15

 * sqlite:///CourseData2.db
29351 rows affected.

[]

In [115]:
%%sql
SELECT COUNT (*)
FROM coursemeetings

 * sqlite:///CourseData2.db
Done.

[(188626,)]

In [116]:
%%sql
INSERT INTO coursemeetings (term,crn,location,day,start,end)
SELECT term,crn,location,day,start,end
FROM import_coursemeetingsS16

 * sqlite:///CourseData2.db
30124 rows affected.

[]

In [117]:
%%sql
SELECT COUNT (*)
FROM coursemeetings

 * sqlite:///CourseData2.db
Done.

[(218750,)]

In [118]:
%%sql
INSERT INTO coursemeetings (term,crn,location,day,start,end)
SELECT term,crn,location,day,start,end
FROM import_coursemeetingsS17

 * sqlite:///CourseData2.db
29738 rows affected.

[]

In [119]:
%%sql
SELECT COUNT (*)
FROM coursemeetings

 * sqlite:///CourseData2.db
Done.

[(248488,)]

In [120]:
%%sql
INSERT INTO coursemeetings (term,crn,location,day,start,end)
SELECT term,crn,location,day,start,end
FROM import_coursemeetingsS18

 * sqlite:///CourseData2.db
29086 rows affected.

[]

In [121]:
%%sql
SELECT COUNT (*)
FROM coursemeetings

 * sqlite:///CourseData2.db
Done.

[(277574,)]

In [122]:
%%sql
INSERT INTO coursemeetings (term,crn,location,day,start,end)
SELECT term,crn,location,day,start,end
FROM import_coursemeetingsS19

 * sqlite:///CourseData2.db
28348 rows affected.

[]

In [123]:
%%sql
SELECT COUNT (*)
FROM coursemeetings

 * sqlite:///CourseData2.db
Done.

[(305922,)]

In [124]:
%%sql
INSERT INTO coursemeetings (term,crn,location,day,start,end)
SELECT term,crn,location,day,start,end
FROM import_coursemeetingsSB17

 * sqlite:///CourseData2.db
5 rows affected.

[]

In [125]:
%%sql
SELECT COUNT (*)
FROM coursemeetings

 * sqlite:///CourseData2.db
Done.

[(305927,)]

In [126]:
%%sql
INSERT INTO coursemeetings (term,crn,location,day,start,end)
SELECT term,crn,location,day,start,end
FROM import_coursemeetingsSU15

 * sqlite:///CourseData2.db
2584 rows affected.

[]

In [127]:
%%sql
SELECT COUNT (*)
FROM coursemeetings

 * sqlite:///CourseData2.db
Done.

[(308511,)]

In [128]:
%%sql
INSERT INTO coursemeetings (term,crn,location,day,start,end)
SELECT term,crn,location,day,start,end
FROM import_coursemeetingsSU16

 * sqlite:///CourseData2.db
3007 rows affected.

[]

In [129]:
%%sql
SELECT COUNT (*)
FROM coursemeetings

 * sqlite:///CourseData2.db
Done.

[(311518,)]

In [130]:
%%sql
INSERT INTO coursemeetings (term,crn,location,day,start,end)
SELECT term,crn,location,day,start,end
FROM import_coursemeetingsSU17

 * sqlite:///CourseData2.db
2666 rows affected.

[]

In [131]:
%%sql
SELECT COUNT (*)
FROM coursemeetings

 * sqlite:///CourseData2.db
Done.

[(314184,)]

In [132]:
%%sql
INSERT INTO coursemeetings (term,crn,location,day,start,end)
SELECT term,crn,location,day,start,end
FROM import_coursemeetingsSU18

 * sqlite:///CourseData2.db
2624 rows affected.

[]

In [133]:
%%sql
SELECT COUNT (*)
FROM coursemeetings

 * sqlite:///CourseData2.db
Done.

[(316808,)]

In [134]:
%%sql
INSERT INTO coursemeetings (term,crn,location,day,start,end)
SELECT term,crn,location,day,start,end
FROM import_coursemeetingsW15

 * sqlite:///CourseData2.db
101 rows affected.

[]

In [135]:
%%sql
SELECT COUNT (*)
FROM coursemeetings

 * sqlite:///CourseData2.db
Done.

[(316909,)]

In [136]:
%%sql
INSERT INTO coursemeetings (term,crn,location,day,start,end)
SELECT term,crn,location,day,start,end
FROM import_coursemeetingsW16

 * sqlite:///CourseData2.db
106 rows affected.

[]

In [137]:
%%sql
SELECT COUNT (*)
FROM coursemeetings

 * sqlite:///CourseData2.db
Done.

[(317015,)]

In [138]:
%%sql
INSERT INTO coursemeetings (term,crn,location,day,start,end)
SELECT term,crn,location,day,start,end
FROM import_coursemeetingsW17

 * sqlite:///CourseData2.db
213 rows affected.

[]

In [139]:
%%sql
SELECT COUNT (*)
FROM coursemeetings

 * sqlite:///CourseData2.db
Done.

[(317228,)]

In [140]:
%%sql
INSERT INTO coursemeetings (term,crn,location,day,start,end)
SELECT term,crn,location,day,start,end
FROM import_coursemeetingsW18

 * sqlite:///CourseData2.db
93 rows affected.

[]

In [141]:
%%sql
SELECT COUNT (*)
FROM coursemeetings

 * sqlite:///CourseData2.db
Done.

[(317321,)]

In [142]:
%%sql
DROP TABLE courses;
CREATE TABLE courses (
    term TEXT NOT NULL,
    crn INTEGER SURROGATE KEY,
    catalog_id TEXT NOT NULL,
    section TEXT NOT NULL,
    credits FLOAT NOT NULL,
    title TEXT NOT NULL,
    meetings TEXT NOT NULL,
    timecodes TEXT NOT NULL,
    primary_instructor TEXT NOT NULL,
    cap INTEGER NOT NULL,
    act INTEGER NOT NULL,
    rem INTEGER NOT NULL);

 * sqlite:///CourseData2.db
Done.
Done.

[]

In [143]:
%%sql
INSERT INTO courses (term,crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem)
SELECT term,crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem
FROM import_coursesF14

 * sqlite:///CourseData2.db
1522 rows affected.

[]

In [144]:
%%sql
INSERT INTO courses (term,crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem)
SELECT term,crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem
FROM import_coursesF15

 * sqlite:///CourseData2.db
1475 rows affected.

[]

In [145]:
%%sql
SELECT COUNT (*)
FROM courses

 * sqlite:///CourseData2.db
Done.

[(2997,)]

In [146]:
%%sql
INSERT INTO courses (term,crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem)
SELECT term,crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem
FROM import_coursesF16

 * sqlite:///CourseData2.db
1491 rows affected.

[]

In [147]:
%%sql
SELECT COUNT (*)
FROM courses

 * sqlite:///CourseData2.db
Done.

[(4488,)]

In [148]:
%%sql
INSERT INTO courses (term,crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem)
SELECT term,crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem
FROM import_coursesF17

 * sqlite:///CourseData2.db
1479 rows affected.

[]

In [149]:
%%sql
INSERT INTO courses (term,crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem)
SELECT term,crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem
FROM import_coursesF18

 * sqlite:///CourseData2.db
1519 rows affected.

[]

In [150]:
%%sql
SELECT COUNT (*)
FROM courses

 * sqlite:///CourseData2.db
Done.

[(7486,)]

In [151]:
%%sql
INSERT INTO courses (term,crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem)
SELECT term,crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem
FROM import_coursesS15

 * sqlite:///CourseData2.db
1421 rows affected.

[]

In [152]:
%%sql
INSERT INTO courses (term,crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem)
SELECT term,crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem
FROM import_coursesS16

 * sqlite:///CourseData2.db
1387 rows affected.

[]

In [153]:
%%sql
INSERT INTO courses (term,crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem)
SELECT term,crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem
FROM import_coursesS17

 * sqlite:///CourseData2.db
1435 rows affected.

[]

In [154]:
%%sql
INSERT INTO courses (term,crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem)
SELECT term,crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem
FROM import_coursesS18

 * sqlite:///CourseData2.db
1405 rows affected.

[]

In [155]:
%%sql
SELECT COUNT (*)
FROM courses

 * sqlite:///CourseData2.db
Done.

[(13134,)]

In [156]:
%%sql
INSERT INTO courses (term,crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem)
SELECT term,crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem
FROM import_coursesS19

 * sqlite:///CourseData2.db
1473 rows affected.

[]

In [157]:
%%sql
SELECT COUNT (*)
FROM courses

 * sqlite:///CourseData2.db
Done.

[(14607,)]

In [158]:
%%sql
INSERT INTO courses (term,crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem)
SELECT term,crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem
FROM import_coursesSB17

 * sqlite:///CourseData2.db
1 rows affected.

[]

In [159]:
%%sql
INSERT INTO courses (term,crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem)
SELECT term,crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem
FROM import_coursesSU15

 * sqlite:///CourseData2.db
316 rows affected.

[]

In [160]:
%%sql
INSERT INTO courses (term,crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem)
SELECT term,crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem
FROM import_coursesSU16

 * sqlite:///CourseData2.db
310 rows affected.

[]

In [161]:
%%sql
INSERT INTO courses (term,crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem)
SELECT term,crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem
FROM import_coursesSU17

 * sqlite:///CourseData2.db
285 rows affected.

[]

In [162]:
%%sql
INSERT INTO courses (term,crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem)
SELECT term,crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem
FROM import_coursesSU18

 * sqlite:///CourseData2.db
313 rows affected.

[]

In [163]:
%%sql
SELECT COUNT (*)
FROM courses

 * sqlite:///CourseData2.db
Done.

[(15832,)]

In [164]:
%%sql
INSERT INTO courses (term,crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem)
SELECT term,crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem
FROM import_coursesW15

 * sqlite:///CourseData2.db
25 rows affected.

[]

In [165]:
%%sql
INSERT INTO courses (term,crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem)
SELECT term,crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem
FROM import_coursesW16

 * sqlite:///CourseData2.db
28 rows affected.

[]

In [166]:
%%sql
INSERT INTO courses (term,crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem)
SELECT term,crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem
FROM import_coursesW17

 * sqlite:///CourseData2.db
24 rows affected.

[]

In [167]:
%%sql
INSERT INTO courses (term,crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem)
SELECT term,crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem
FROM import_coursesW18

 * sqlite:///CourseData2.db
28 rows affected.

[]

In [168]:
%%sql
SELECT COUNT (*)
FROM courses

 * sqlite:///CourseData2.db
Done.

[(15937,)]

In [172]:
%%sql
DROP TABLE coursecatalog;
CREATE TABLE coursecatalog (
program_code TEXT NOT NULL,
program_name TEXT NOT NULL,
catalog_id TEXT SURROGATE KEY,
course_title TEXT NOT NULL,
credits TEXT,
prereqs TEXT,
coreqs TEXT,
fees TEXT,
attributes TEXT,
description TEXT NOT NULL);

 * sqlite:///CourseData2.db
Done.
Done.

[]

In [173]:
%%sql
INSERT INTO coursecatalog (program_code, program_name, catalog_id, course_title, credits, prereqs, coreqs, fees, attributes, description)
SELECT program_code, program_name, catalog_id, course_title, credits, prereqs, coreqs, fees, attributes, description 
FROM coursecatalog17_18;

 * sqlite:///CourseData2.db
2220 rows affected.

[]

In [174]:
%%sql
ALTER TABLE coursecatalog
ADD term TEXT;

 * sqlite:///CourseData2.db
Done.

[]

In [175]:
%%sql
UPDATE coursecatalog
SET term = '2017-2018';

 * sqlite:///CourseData2.db
2220 rows affected.

[]

In [176]:
%%sql
SELECT * 
FROM coursecatalog
LIMIT 5;

 * sqlite:///CourseData2.db
Done.

[('AN', 'Asian Studies', 'AN 0301', 'Independent Study', '1-3 Credits', '', '', '', '', 'Students undertake an individualized program of study in consultation with a director from the Asian studies faculty.', '2017-2018'),
 ('AN', 'Asian Studies', 'AN 0310', 'Asian Studies Seminar', '3 Credits', '', '', '', '', 'This seminar examines selected topics concerning Asia. This course is taught in conjunction with another 100-300 level course from a rotation of cour ... (412 characters truncated) ... e term paper in substitution of some portion of the conjoined course requirements, as determined by the instructor. Open to juniors and seniors only.', '2017-2018'),
 ('BU', 'Business', 'BU 0211', 'Legal Environment of Business', '3 Credits', 'Junior standing.', '', '', '', 'This course examines the broad philosophical as well as practical nature and function of the legal system, and introduces students to the legal and s ... (171 characters truncated) ... ivil process, and regulatory areas such as employment discrimination, protection of the environment, and corporate governance and securities markets.', '2017-2018'),
 ('BU', 'Business', 'BU 0220', 'Environmental Law and Policy', '3 Credits', '', '', '', 'EVME Environmental Studies Major Elective, EVPE Environmental Studies Elective, EVSS Environmental Studies: Social Science, MGEL Management: General Elective', 'This course surveys issues arising out of federal laws designed to protect the environment and manage resources. It considers in detail the role of t ... (298 characters truncated) ... t groups in shaping environmental policy, giving special attention to the impact of environmental regulation on business and private property rights.', '2017-2018'),
 ('BU', 'Business', 'BU 0311', 'The Law of Contracts, Sales, and Property', '3 Credits', 'BU 0211.', '', '', '', 'This course examines the components of common law contracts including the concepts of offer and acceptance, consideration, capacity and legality, ass ... (117 characters truncated) ...  the Uniform Commercial Code relating to leases, sales of goods, and warranties. The course also considers personal and real property, and bailments.', '2017-2018')]

In [177]:
%%sql
INSERT INTO coursecatalog (program_code, program_name, catalog_id, course_title, credits, prereqs, coreqs, fees, attributes, description)
SELECT program_code, program_name, catalog_id, course_title, credits, prereqs, coreqs, fees, attributes, description 
FROM coursecatalog18_19;

 * sqlite:///CourseData2.db
2220 rows affected.

[]